<?php

return [
    'signin' => [
        'success' => 'شما با نام کاربری خود وارد سایت شدید',
    ],
    'logout' => [
        'success' => 'شما از نام کاربری خود خارج شدید',
    ],
    'signup' => [
        'messages' => [
            'signup_code' => ':code',
            'code_sent' => 'کد تایید برای شما پیامک شد، لطفا کد را در قسمت پایین وارد و کلید تایید را بزنید',
            'verify_success' => 'شماره شما با موفقیت تایید شد. با ثبت رمز و نام کاربری ثبت نام خود را کامل کنید',
            'verify_failed' => 'این کد یا شماره همراه صحیح نیست',
            'already_exist' => 'یک اکانت کاربری با این شماره در سیستم ثبت است. آیا مایل به بازیابی رمز هستید؟',
            'from' => 'SMS Service',
        ],
    ],

    'exceptions' => [
        'no_gateway' => 'درگاه پیامکی برای ثبت نام ثبت نشده است',
        'phone_expired' => 'این کد منقضی شده است. لطفا کد جدید دریافت کنید',
        'no_customer_role' => 'نقشی برای ثبت نام تعیین نشده است',
        'invalid_password' => 'رمز عبور صحیح نیست',
        'invalid_credentials' => 'نام کاربری یا رمز عبور صحیح نیست',
        'banned' => 'دسترسی شما محدود شده است. لطفا با پشتیبانی تماس بگیرید',
    ],

];
